cf/InformationRegisters/_DemoNotesOnSubjectAvailable.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>_DemoNotesOnSubjectAvailable</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>HasNotes</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SubjectOf</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.NotesSubject</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Notes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Notes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubjectOf</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.NotesSubject</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentText</Name>
					<Comment>Full-text search details</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForDesktop</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Check</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NoteColors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/_DemoNotes/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region Private

// Writes to the internal information register a record about the note presence.
//
// On catalog item write, the parameters match the handler parameters.
//
Procedure CheckIfThereAreNotesOnSubject(Source, Cancel) Export
	
	If Source.DataExchange.Load Then 
		Return; 
	EndIf;

	SetPrivilegedMode(True);
	
	If Not ValueIsFilled(Source.SubjectOf) Then
		Return;
	EndIf;
	
	Query = New Query;
	
	QueryText = 
	"SELECT TOP 1
	|	Notes.Ref
	|FROM
	|	Catalog.Notes AS Notes
	|WHERE
	|	Notes.SubjectOf = &SubjectOf
	|	AND Notes.Author = &User
	|	AND Notes.DeletionMark = FALSE";
	Query.Text = QueryText;
	Query.SetParameter("SubjectOf", Source.SubjectOf);
	Query.SetParameter("User", Source.Author);
	
	Block = New DataLock;
	LockItem = Block.Add("Catalog.Notes");
	LockItem.SetValue("SubjectOf", Source.SubjectOf);
	LockItem.SetValue("Author", Source.Author);
	LockItem.Mode = DataLockMode.Shared;
	
	LockItem = Block.Add("InformationRegister._DemoNotesOnSubjectAvailable");
	LockItem.SetValue("SubjectOf", Source.SubjectOf);
	LockItem.SetValue("Author", Source.Author);
	
	RecordSet = InformationRegisters._DemoNotesOnSubjectAvailable.CreateRecordSet();
	RecordSet.Filter.Author.Set(Source.Author);
	RecordSet.Filter.SubjectOf.Set(Source.SubjectOf);
	
	BeginTransaction();
	Try
		Block.Lock();
		Selection = Query.Execute().Select();
		RecordSet.Read();
		
		HasNotes = Selection.Count() > 0;
		If HasNotes Then 
			If RecordSet.Count() = 0 Then
				NewRecord = RecordSet.Add();
				FillPropertyValues(NewRecord, Source);
				NewRecord.HasNotes = True;
			Else
				For Each Record In RecordSet Do
					Record.HasNotes = True;
				EndDo;
			EndIf;
		Else
			RecordSet.Clear();
		EndIf;
		
		RecordSet.Write();
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

#EndRegion
